{
  "backend/main.mo": "Main backend actor implementing complaint management, user profiles, vehicle tracking, and train routes with authentication/authorization, blob storage for photos, and persistent Map-based storage for all entities.",
  "backend/migration.mo": "Migration module that transforms old vehicle records (id, lat/lon, timestamp) to new vehicle records adding name and vehicleType fields with default values.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for debugging and fixing live GPS vehicle tracking in TransportMap.tsx, including backend query integration, polling configuration, and marker management.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 15 frontend files covering pages (alerts, admin, home, transport, tourism), components (complaint forms/lists/maps, train schedules, transport map with live GPS), hooks (useQueries with 5-second polling), and data files.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system for light/dark themes using warm orange/amber primary colors and comprehensive design tokens avoiding blue/purple.",
  "frontend/index.html": "HTML entry point for 'My Belgavi' app with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with 12 routes (home, civic services, complaints, transport, emergency, utilities, engagement, tourism, business, payments, alerts, admin) wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/ComplaintForm.tsx": "Form component for submitting complaints with category/location/description fields, photo upload with preview and progress tracking, and GPS location capture using browser geolocation API with error handling.",
  "frontend/src/components/ComplaintList.tsx": "Displays a filterable list of user complaints with status badges, timeline visualization, maps, and rating components. Includes real-time status change notifications and skeleton loading states.",
  "frontend/src/components/ComplaintMap.tsx": "Renders an embedded OpenStreetMap iframe showing a complaint's location based on latitude/longitude coordinates. Displays a fallback message when location data is unavailable.",
  "frontend/src/components/ComplaintRating.tsx": "Provides a star-based rating interface for resolved complaints with optional feedback text. Shows existing ratings or allows users to submit new ratings.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, navigation menu, and authentication-based route protection. Handles mobile/desktop navigation and triggers profile setup modal for new users.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation requiring name and optional phone, email, and address fields. Cannot be dismissed until profile is created.",
  "frontend/src/components/TrainSchedule.tsx": "Train schedule search interface with three modes: all trains, by station, or between stations. Displays routes in a table with filtering by destination and formatted departure/arrival times.",
  "frontend/src/components/TransportMap.tsx": "React component that renders a Google Maps interface displaying static locations (train stations, parking, EV stations) and real-time vehicle tracking with markers, info windows, and periodic updates.",
  "frontend/src/data/alertsData.ts": "Static data export containing current alerts (flood, AQI), alert history, and user preference options for various alert types like flood, power cut, water supply, and weather.",
  "frontend/src/data/businessData.ts": "Static data export listing local businesses, startup resources, job postings, internships, and training centers in Belgavi with contact information and descriptions.",
  "frontend/src/data/emergencyData.ts": "Static data export providing contact information for emergency services including police stations, hospitals, fire stations, and blood banks in Belgavi.",
  "frontend/src/data/engagementData.ts": "Static data export containing civic engagement content including polls, events, news updates, volunteer opportunities, and community forum threads for Belgavi.",
  "frontend/src/data/paymentsData.ts": "Static data export listing fines, parking sessions, event tickets, and transaction history for municipal payment tracking.",
  "frontend/src/data/tourismData.ts": "Static data export containing tourist attractions with images, hotels, restaurants, markets, and historical sites in Belgavi with descriptions and contact details.",
  "frontend/src/data/transportData.ts": "Static data export providing bus routes with timings, taxi services, parking spots with availability and coordinates, EV charging stations, and train station information for Belgavi.",
  "frontend/src/data/utilitiesData.ts": "Exports static data for utilities including water supply schedules by zone, power outage alerts, garbage collection schedules, and weather forecast information.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including complaints (submit, rate, update status), service links, admin checks, and train/bus schedule queries with real-time polling.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving the current user's profile, with automatic cache invalidation on updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying complaint statistics, charts (bar and pie), and complaint management interface with status updates, requiring admin authentication.",
  "frontend/src/pages/AlertsPage.tsx": "Displays current alerts (flood, air quality) and alert history with severity badges and color-coded AQI indicators using static alertsData.",
  "frontend/src/pages/BusinessPage.tsx": "Displays local businesses, startups, jobs, internships, and training programs with filtering by category and search. Uses tabs to organize different business-related content sections.",
  "frontend/src/pages/CivicServicesPage.tsx": "Provides access to government services like property tax, water bills, electricity, trade licenses, and certificates. Displays service cards with external links and loading states.",
  "frontend/src/pages/ComplaintsPage.tsx": "Allows authenticated users to submit and track civic complaints. Requires Internet Identity login and uses tabs to switch between submission and tracking views.",
  "frontend/src/pages/EmergencyPage.tsx": "Displays emergency contact information including police stations, hospitals, and fire stations with quick-dial buttons for emergency services (100, 108, 101).",
  "frontend/src/pages/EngagementPage.tsx": "Provides citizen engagement features including polls, events, news, volunteer opportunities, and community forums organized in tabs.",
  "frontend/src/pages/HomePage.tsx": "Main landing page showing quick access cards to all services, featured attractions, and a login prompt for unauthenticated users with hero banner.",
  "frontend/src/pages/PaymentsPage.tsx": "React page component for digital payments featuring tabs for municipal fines, parking fees, event tickets, and payment history with UI cards and payment integration placeholders.",
  "frontend/src/pages/TourismPage.tsx": "React page component displaying Belgavi tourism information including attractions, hotels, restaurants, and markets with image cards and contact details.",
  "frontend/src/pages/TransportPage.tsx": "React page component for transport and traffic information with tabs for map view, bus routes, train schedules, taxi services, parking spots, and EV charging stations.",
  "frontend/src/pages/UtilitiesPage.tsx": "React page component displaying smart utilities dashboard with sections for water supply schedules, power cut alerts, garbage collection schedules, and weather updates.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters and sessionStorage, supporting both regular query strings and hash-based routing with persistence helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file tracking 13 versions of a comprehensive smart city application for Belagavi with civic services, complaint management, traffic/transport, emergency services, utilities, tourism, and citizen engagement features. Contains architectural notes for multi-language support, API integrations, GPS tracking, payment gateways, real-time data feeds, blockchain complaint tracking, and AI/ML components, with one known issue regarding live GPS vehicle tracking."
}