{
  "backend/main.mo": "Main Motoko actor implementing a smart city backend with complaint management, vehicle tracking, user profiles, train routes, and access control. Includes CRUD operations for complaints with GPS coordinates, vehicle location updates, and admin/user authorization.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of periodic vehicle location updates on the transport map, linking frontend components (TransportMap.tsx, useQueries.ts) with backend functions and test ID REQ-39.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and data files. Describes the smart city app's features like complaint tracking with GPS, transport maps with real-time vehicle updates, tourism info, admin dashboard, and authentication-aware navigation.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining warm orange/amber primary colors and comprehensive light/dark mode theme tokens. Includes custom CSS variables for UI components like cards, buttons, charts, and sidebar.",
  "frontend/index.html": "HTML entry point for the React application titled 'My Belgavi' with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app component setting up TanStack Router with 12 routes (home, civic services, complaints, transport, emergency, utilities, engagement, tourism, business, payments, alerts, admin) wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/ComplaintForm.tsx": "Form component for submitting complaints with category/location/description fields, photo upload with preview and progress tracking, and GPS location capture using browser geolocation API with error handling.",
  "frontend/src/components/ComplaintList.tsx": "Displays user complaints with status filtering, real-time status change indicators with animations, progress timeline visualization, and integrated map display for GPS coordinates. Uses polling to detect status updates.",
  "frontend/src/components/ComplaintMap.tsx": "React component that displays a complaint location on an embedded OpenStreetMap iframe using latitude and longitude coordinates, with a fallback UI when location data is unavailable.",
  "frontend/src/components/ComplaintRating.tsx": "React component that allows users to rate and provide feedback on resolved complaints using a 5-star rating system, displaying existing ratings or a submission form based on complaint state.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with mobile/desktop menus, authentication-based route protection, and profile setup modal integration for the My Belgavi smart city application.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and error handling, clearing the query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for first-time user profile setup, collecting name (required), phone, email, and address fields with form validation and submission handling.",
  "frontend/src/components/TrainSchedule.tsx": "Train schedule search component with three modes (all trains, by station, between stations) that displays train routes in a table with filtering by destination and time formatting.",
  "frontend/src/components/TransportMap.tsx": "Google Maps integration component that displays static transport locations (train stations, parking, EV charging) and real-time vehicle tracking with admin simulation controls for testing vehicle movement.",
  "frontend/src/data/alertsData.ts": "Static data export containing mock alert information including current alerts, air quality index data, alert history, and user preference options for different alert types.",
  "frontend/src/data/businessData.ts": "Exports static data for businesses, startup resources, job listings, internships, and training centers in Belgavi with contact information and descriptions.",
  "frontend/src/data/emergencyData.ts": "Exports static emergency contact data including police stations, hospitals, fire stations, and blood banks in Belgavi with phone numbers and addresses.",
  "frontend/src/data/engagementData.ts": "Exports civic engagement data including polls, events, news articles, volunteer opportunities, and forum threads for citizen participation.",
  "frontend/src/data/paymentsData.ts": "Exports payment-related data including fines, parking sessions, event tickets, and transaction history with amounts and statuses.",
  "frontend/src/data/tourismData.ts": "Exports tourism information for Belgavi including attractions with images, hotels, restaurants, markets, and historical sites with descriptions and contact details.",
  "frontend/src/data/transportData.ts": "Exports transportation data including bus routes with timings, taxi services, parking spots with availability, EV charging stations, and train stations with coordinates.",
  "frontend/src/data/utilitiesData.ts": "Exports utility service data including water supply schedules by zone, power outage alerts, garbage collection schedules, and weather forecast information.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance using Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data including complaints, service links, train routes, vehicles, and admin operations with automatic cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving user profile data with automatic cache invalidation on updates.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying complaint statistics, charts (bar and pie), and complaint management with status updates, requiring admin authentication.",
  "frontend/src/pages/AlertsPage.tsx": "Displays current alerts (flood, air quality) and alert history with severity badges and color-coded indicators using static data.",
  "frontend/src/pages/BusinessPage.tsx": "Multi-tab page for browsing local businesses with filtering/search, plus sections for startups, jobs, internships, and training programs using static business data.",
  "frontend/src/pages/CivicServicesPage.tsx": "Displays a grid of civic service cards (property tax, water bill, electricity, trade license, birth/death certificates) with external links fetched via useGetServiceLinks hook. Shows loading skeletons while data is being fetched.",
  "frontend/src/pages/ComplaintsPage.tsx": "Provides a tabbed interface for submitting and tracking complaints, requiring Internet Identity authentication. Displays a login prompt if the user is not authenticated.",
  "frontend/src/pages/EmergencyPage.tsx": "Shows emergency contact buttons (police, ambulance, fire) and lists police stations, hospitals, and fire stations with addresses and phone numbers from emergencyData.",
  "frontend/src/pages/EngagementPage.tsx": "Tabbed page displaying polls with voting percentages, upcoming events, news items, volunteer opportunities, and forum discussions from engagementData.",
  "frontend/src/pages/HomePage.tsx": "Landing page that shows a login prompt with hero banner for unauthenticated users, or a grid of quick-access service cards and featured attractions for authenticated users.",
  "frontend/src/pages/PaymentsPage.tsx": "Tabbed interface for viewing and paying municipal fines, parking fees, and event tickets, with payment history. Includes a note about payment gateway integration readiness.",
  "frontend/src/pages/TourismPage.tsx": "Displays Belgavi tourism information including top attractions with images, hotels with star ratings, restaurants with cuisine types, and local markets organized in tabs.",
  "frontend/src/pages/TransportPage.tsx": "Shows transport and traffic information with tabs for an interactive map, bus routes with timings, train schedules, taxi/auto services, parking spots, and EV charging stations.",
  "frontend/src/pages/UtilitiesPage.tsx": "Displays smart utilities dashboard with water supply schedules by zone, power cut alerts, garbage collection schedules, and current/forecast weather information.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining My Belgavi smart city application with architectural notes for multi-language support, API integrations, GPS services, payment gateways, and a known issue with GPS vehicle tracking on transport map."
}