{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement vehicle location update function and enhance train schedule",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Connect the frontend to call addOrUpdateVehicleLocation backend function and enable periodic vehicle location updates to show movement on the transport map",
      "acceptanceCriteria": [
        "Frontend useQueries.ts includes a mutation hook for addOrUpdateVehicleLocation",
        "TransportMap component can trigger location updates for test vehicles",
        "Vehicle markers on the map update smoothly when new location data arrives",
        "Location update errors are handled and logged appropriately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add mutation hook useAddOrUpdateVehicleLocation that calls the backend addOrUpdateVehicleLocation function accepting vehicleId, latitude, longitude, and timestamp parameters. Configure mutation to invalidate vehicleLocations query cache on success to trigger map refresh. Include error handling for invalid coordinates and network failures."
        },
        {
          "path": "frontend/src/components/TransportMap.tsx",
          "operation": "modify",
          "description": "Import and integrate the useAddOrUpdateVehicleLocation mutation hook. Add test vehicle location update functionality (e.g., a button or periodic test updates) to demonstrate the mutation working. Ensure vehicle markers respond to location data changes from the polling mechanism. Add error logging for failed location updates. Preserve existing Google Maps integration and 5-second polling interval."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Enhance the train schedule display on the transport page with comprehensive schedule information, improved visual layout, and better filtering capabilities",
      "acceptanceCriteria": [
        "Train schedule display shows detailed timing and route information in an organized table format",
        "Users can filter trains by station, destination, or route",
        "Schedule information includes departure times, arrival times, train numbers, and intermediate stations",
        "Layout is responsive and works well on mobile and desktop devices",
        "Visual design is consistent with the app's warm orange/amber theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TrainSchedule.tsx",
          "operation": "modify",
          "description": "Enhance the train schedule display with comprehensive timing and route information. Expand the table to show departure times, arrival times, train numbers, train names, origin/destination stations, and intermediate stops from TrainRoute.schedule array. Add filtering options for destination station. Improve table layout to be fully responsive on mobile and desktop. Ensure visual design uses the app's warm orange/amber color scheme from Tailwind config. Add loading states and error handling for train schedule queries."
        }
      ]
    }
  ]
}